EMACS-AND-ESP-IDF.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-19 周四 19:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="LuHui" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org6e370ee" class="outline-2">
<h2 id="org6e370ee">EMACS &amp; ESP-IDF</h2>
<div class="outline-text-2" id="text-org6e370ee">
<p>
VSCODE IS TOO SLOW ON MY MACHINE, SO I USE GNU EMACS
</p>
</div>
<div id="outline-container-org739a0ee" class="outline-3">
<h3 id="org739a0ee">INSTALL ESP-IDF</h3>
<div class="outline-text-3" id="text-org739a0ee">
<p>
<a href="https://docs.espressif.com/projects/esp-idf/en/latest/esp32h2/get-started/linux-macos-setup.html">https://docs.espressif.com/projects/esp-idf/en/latest/esp32h2/get-started/linux-macos-setup.html</a>
</p>
</div>
</div>
<div id="outline-container-org6fc4f37" class="outline-3">
<h3 id="org6fc4f37">INSTALL EMACS PLUGIN</h3>
<div class="outline-text-3" id="text-org6fc4f37">
<ul class="org-ul">
<li>EGLOT</li>
<li>COMPANY</li>
</ul>

<p>
EGLOT HAS ALREADY INCLUDED IN THE LATEST VERSION OF GNU EMACS
</p>

<div class="org-src-container">
<pre class="src src-nil">M-x package-install company
</pre>
</div>
</div>
</div>
<div id="outline-container-org116340a" class="outline-3">
<h3 id="org116340a">EDIT EMACS CONFIG FILE</h3>
<div class="outline-text-3" id="text-org116340a">
<p>
ADD:
</p>

<div class="org-src-container">
<pre class="src src-nil">(require 'eglot)
(add-to-list 'eglot-server-programs
             '((c++-mode c-mode) .
               ("clangd" "--query-driver=**" "--header-insertion=never")))
(add-hook 'c-mode-hook 'eglot-ensure)
(add-hook 'c-mode-hook 'company-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga572788" class="outline-3">
<h3 id="orga572788">CREATE ESP-IDF PROJECT</h3>
<div class="outline-text-3" id="text-orga572788">
<div class="org-src-container">
<pre class="src src-shell">cd /path/to/esp-idf/
. export.sh
cd /xxx/xxx
idf.py create-project hello
cd hello
idf.py set-target esp32xx
idf.py build
idf.py flash -p /dev/ttyACMX
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc381ee4" class="outline-3">
<h3 id="orgc381ee4">ADD CLANGD CONFIG FILE</h3>
<div class="outline-text-3" id="text-orgc381ee4">
<p>
WE NEED FIX CLANGD TO WORK IN A CROSS COMPILATION ENVIRONMENT
</p>

<p>
ADD .clangd ON PROJECT ROOT:
</p>

<div class="org-src-container">
<pre class="src src-nil">CompileFlags:
  Add: -Wno-unknown-warning-option
  Remove: [-m*, -f*]
Diagnostics:
  UnusedIncludes: None
CompileFlags:
  BuiltinHeaders: QueryDriver
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf29aa8e" class="outline-3">
<h3 id="orgf29aa8e">LINK compile<sub>commands.json</sub></h3>
<div class="outline-text-3" id="text-orgf29aa8e">
<div class="org-src-container">
<pre class="src src-shell">cd hello/
ln -sf build/compile_commands.json .
</pre>
</div>
</div>
</div>
<div id="outline-container-org40c34db" class="outline-3">
<h3 id="org40c34db">USE EMACS</h3>
<div class="outline-text-3" id="text-org40c34db">
<div class="org-src-container">
<pre class="src src-shell">cd hello/
emacs main/hello.c
</pre>
</div>

<p>
THEN TYPE 'prin' TO TEST EGLOT AND COMPANY WORKING
</p>
</div>
</div>
<div id="outline-container-orgd795400" class="outline-3">
<h3 id="orgd795400">EXAMPLE</h3>
<div class="outline-text-3" id="text-orgd795400">
<p>
<a href="https://github.com/EBREAK/esp32-hello">https://github.com/EBREAK/esp32-hello</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
